soap-examples/quickstart/src/test/java/org/reficio/ws/quickstart/auth/AuthDigestEnvelope.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-AC75DEAFC578E427F715347329469191">
                <wsse:Username>kevin</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">
                    dnaBcwLFJZGw6oNT3cbOmPvEZHg=
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    BpZf+yA5NAWKaY22FGMe5w==
                </wsse:Nonce>
                <wsu:Created>2018-08-20T02:42:26.918Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns2:echo xmlns:ns2="http://coding.ws.successchannel.com/">
            <arg0>ssss</arg0>
        </ns2:echo>
    </soap:Body>
</soap:Envelope>


